SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_burtc.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG23 BURTC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG23_BURTC_H
#define EFR32SG23_BURTC_H

#define BURTC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG23_BURTC BURTC
 * @{
 * @brief EFR32SG23 BURTC Register Declaration.
 *****************************************************************************/

/** BURTC Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP version ID                                      */
  __IOM uint32_t             EN;                     /**< Module Enable Register                             */
  __IOM uint32_t             CFG;                    /**< Configuration Register                             */
  __IOM uint32_t             CMD;                    /**< Command Register                                   */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
  __IOM uint32_t             PRECNT;                 /**< Pre-Counter Value Register                         */
  __IOM uint32_t             CNT;                    /**< Counter Value Register                             */
  __IOM uint32_t             EM4WUEN;                /**< EM4 wakeup request Enable Register                 */
  __IM  uint32_t             SYNCBUSY;               /**< Synchronization Busy Register                      */
  __IOM uint32_t             LOCK;                   /**< Configuration Lock Register                        */
  __IOM uint32_t             COMP;                   /**< Compare Value Register                             */
        uint32_t             RESERVED0[1011U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP version ID                                      */
  __IOM uint32_t             EN_SET;                 /**< Module Enable Register                             */
  __IOM uint32_t             CFG_SET;                /**< Configuration Register                             */
  __IOM uint32_t             CMD_SET;                /**< Command Register                                   */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             PRECNT_SET;             /**< Pre-Counter Value Register                         */
  __IOM uint32_t             CNT_SET;                /**< Counter Value Register                             */
  __IOM uint32_t             EM4WUEN_SET;            /**< EM4 wakeup request Enable Register                 */
  __IM  uint32_t             SYNCBUSY_SET;           /**< Synchronization Busy Register                      */
  __IOM uint32_t             LOCK_SET;               /**< Configuration Lock Register                        */
  __IOM uint32_t             COMP_SET;               /**< Compare Value Register                             */
        uint32_t             RESERVED1[1011U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP version ID                                      */
  __IOM uint32_t             EN_CLR;                 /**< Module Enable Register                             */
  __IOM uint32_t             CFG_CLR;                /**< Configuration Register                             */
  __IOM uint32_t             CMD_CLR;                /**< Command Register                                   */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             PRECNT_CLR;             /**< Pre-Counter Value Register                         */
  __IOM uint32_t             CNT_CLR;                /**< Counter Value Register                             */
  __IOM uint32_t             EM4WUEN_CLR;            /**< EM4 wakeup request Enable Register                 */
  __IM  uint32_t             SYNCBUSY_CLR;           /**< Synchronization Busy Register                      */
  __IOM uint32_t             LOCK_CLR;               /**< Configuration Lock Register                        */
  __IOM uint32_t             COMP_CLR;               /**< Compare Value Register                             */
        uint32_t             RESERVED2[1011U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP version ID                                      */
  __IOM uint32_t             EN_TGL;                 /**< Module Enable Register                             */
  __IOM uint32_t             CFG_TGL;                /**< Configuration Register                             */
  __IOM uint32_t             CMD_TGL;                /**< Command Register                                   */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             PRECNT_TGL;             /**< Pre-Counter Value Register                         */
  __IOM uint32_t             CNT_TGL;                /**< Counter Value Register                             */
  __IOM uint32_t             EM4WUEN_TGL;            /**< EM4 wakeup request Enable Register                 */
  __IM  uint32_t             SYNCBUSY_TGL;           /**< Synchronization Busy Register                      */
  __IOM uint32_t             LOCK_TGL;               /**< Configuration Lock Register                        */
  __IOM uint32_t             COMP_TGL;               /**< Compare Value Register                             */
} BURTC_TypeDef;
