SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_burtc.h
/* Bit fields for BURTC SYNCBUSY */
#define _BURTC_SYNCBUSY_RESETVALUE              0x00000000UL                            /**< Default value for BURTC_SYNCBUSY            */
#define _BURTC_SYNCBUSY_MASK                    0x0000001FUL                            /**< Mask for BURTC_SYNCBUSY                     */
#define BURTC_SYNCBUSY_START                    (0x1UL << 0)                            /**< Sync busy for START                         */
#define _BURTC_SYNCBUSY_START_SHIFT             0                                       /**< Shift value for BURTC_START                 */
#define _BURTC_SYNCBUSY_START_MASK              0x1UL                                   /**< Bit mask for BURTC_START                    */
#define _BURTC_SYNCBUSY_START_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for BURTC_SYNCBUSY             */
#define BURTC_SYNCBUSY_START_DEFAULT            (_BURTC_SYNCBUSY_START_DEFAULT << 0)    /**< Shifted mode DEFAULT for BURTC_SYNCBUSY     */
#define BURTC_SYNCBUSY_STOP                     (0x1UL << 1)                            /**< Sync busy for STOP                          */
#define _BURTC_SYNCBUSY_STOP_SHIFT              1                                       /**< Shift value for BURTC_STOP                  */
#define _BURTC_SYNCBUSY_STOP_MASK               0x2UL                                   /**< Bit mask for BURTC_STOP                     */
#define _BURTC_SYNCBUSY_STOP_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for BURTC_SYNCBUSY             */
#define BURTC_SYNCBUSY_STOP_DEFAULT             (_BURTC_SYNCBUSY_STOP_DEFAULT << 1)     /**< Shifted mode DEFAULT for BURTC_SYNCBUSY     */
#define BURTC_SYNCBUSY_PRECNT                   (0x1UL << 2)                            /**< Sync busy for PRECNT                        */
#define _BURTC_SYNCBUSY_PRECNT_SHIFT            2                                       /**< Shift value for BURTC_PRECNT                */
#define _BURTC_SYNCBUSY_PRECNT_MASK             0x4UL                                   /**< Bit mask for BURTC_PRECNT                   */
#define _BURTC_SYNCBUSY_PRECNT_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for BURTC_SYNCBUSY             */
#define BURTC_SYNCBUSY_PRECNT_DEFAULT           (_BURTC_SYNCBUSY_PRECNT_DEFAULT << 2)   /**< Shifted mode DEFAULT for BURTC_SYNCBUSY     */
#define BURTC_SYNCBUSY_CNT                      (0x1UL << 3)                            /**< Sync busy for CNT                           */
#define _BURTC_SYNCBUSY_CNT_SHIFT               3                                       /**< Shift value for BURTC_CNT                   */
#define _BURTC_SYNCBUSY_CNT_MASK                0x8UL                                   /**< Bit mask for BURTC_CNT                      */
#define _BURTC_SYNCBUSY_CNT_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for BURTC_SYNCBUSY             */
#define BURTC_SYNCBUSY_CNT_DEFAULT              (_BURTC_SYNCBUSY_CNT_DEFAULT << 3)      /**< Shifted mode DEFAULT for BURTC_SYNCBUSY     */
#define BURTC_SYNCBUSY_COMP                     (0x1UL << 4)                            /**< Sync busy for COMP                          */
#define _BURTC_SYNCBUSY_COMP_SHIFT              4                                       /**< Shift value for BURTC_COMP                  */
#define _BURTC_SYNCBUSY_COMP_MASK               0x10UL                                  /**< Bit mask for BURTC_COMP                     */
#define _BURTC_SYNCBUSY_COMP_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for BURTC_SYNCBUSY             */
#define BURTC_SYNCBUSY_COMP_DEFAULT             (_BURTC_SYNCBUSY_COMP_DEFAULT << 4)     /**< Shifted mode DEFAULT for BURTC_SYNCBUSY     */

/* Bit fields for BURTC LOCK */
#define _BURTC_LOCK_RESETVALUE                  0x0000AEE8UL                            /**< Default value for BURTC_LOCK                */
#define _BURTC_LOCK_MASK                        0x0000FFFFUL                            /**< Mask for BURTC_LOCK                         */
#define _BURTC_LOCK_LOCKKEY_SHIFT               0                                       /**< Shift value for BURTC_LOCKKEY               */
#define _BURTC_LOCK_LOCKKEY_MASK                0xFFFFUL                                /**< Bit mask for BURTC_LOCKKEY                  */
#define _BURTC_LOCK_LOCKKEY_DEFAULT             0x0000AEE8UL                            /**< Mode DEFAULT for BURTC_LOCK                 */
#define _BURTC_LOCK_LOCKKEY_UNLOCK              0x0000AEE8UL                            /**< Mode UNLOCK for BURTC_LOCK                  */
#define BURTC_LOCK_LOCKKEY_DEFAULT              (_BURTC_LOCK_LOCKKEY_DEFAULT << 0)      /**< Shifted mode DEFAULT for BURTC_LOCK         */
#define BURTC_LOCK_LOCKKEY_UNLOCK               (_BURTC_LOCK_LOCKKEY_UNLOCK << 0)       /**< Shifted mode UNLOCK for BURTC_LOCK          */

/* Bit fields for BURTC COMP */
#define _BURTC_COMP_RESETVALUE                  0x00000000UL                            /**< Default value for BURTC_COMP                */
#define _BURTC_COMP_MASK                        0xFFFFFFFFUL                            /**< Mask for BURTC_COMP                         */
#define _BURTC_COMP_COMP_SHIFT                  0                                       /**< Shift value for BURTC_COMP                  */
#define _BURTC_COMP_COMP_MASK                   0xFFFFFFFFUL                            /**< Bit mask for BURTC_COMP                     */
#define _BURTC_COMP_COMP_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for BURTC_COMP                 */
#define BURTC_COMP_COMP_DEFAULT                 (_BURTC_COMP_COMP_DEFAULT << 0)         /**< Shifted mode DEFAULT for BURTC_COMP         */

/** @} End of group EFR32SG23_BURTC_BitFields */
/** @} End of group EFR32SG23_BURTC */
/** @} End of group Parts */

#endif // EFR32SG23_BURTC_H
